Repository: maangataapps/terapiasdaluna_flutter
Catalog: lib/infrastructure/l10n/app_*.arb
Languages: es, pt

source: Loading
es: Cargando
pt: A carregar

# username_hint
source: Write your user name here
pt: Escreve o teu nome de utilizador aqui

# password_hint
source: Write your password
es: Escribe aquí tu contraseña
pt: Escreve a tua palavra-passe

# repeat_password
source: Repeat your password
es: Repite la contraseña
pt: Repete a tua palavra-passe

source: Login
pt: Entrar

source: Register
es: Registrarse
pt: Registar

# dont_have_account
source: You don't have an account?
es: ¿No tienes cuenta?
pt: Não tens uma conta?

# forgotten_password
source: Have you forgotten your password?
es: ¿Has olvidado tu password?
pt: Esqueceste-te da tua palavra-passe?

source: Generic error
pt: Erro genérico

source: Dismiss
es: Ocultar
pt: Ignorar

source: Passwords don't match
es: Los passwords no coinciden
pt: As palavras-passe não coincidem

# unknown_error
source: There was an error. Try again in a while
pt: Ocorreu um erro. Tenta novamente mais tarde

# weak_password_error
source: Your password is too weak
pt: A tua palavra-passe é muito fraca

# user_not_created_error
source: The user wasn't created. Try again later
pt: O utilizador não foi criado. Tenta novamente mais tarde

# username_empty_or_null_error
source: This field can't be empty
es: Tienes que introducir un nombre de usuario
pt: Este campo não pode estar vazio

# email_format_error
source: The email doesn't have the right format
es: El email introducido contiene errores
pt: O email não tem o formato correto

# empty_repeat_password
source: This field can't be empty
es: Este campo no puede estar vacío
pt: Este campo não pode estar vazio

# repeat_password_error
source: The passwords don't match
es: Las contraseñas no coinciden
pt: As palavras-passe não coincidem

# invalid_password_error
source: The password must be 8 characters long at least, and contain one lower case letter, one uppercase letter and one number at least.
es: La contraseña debe tener al menos 8 caracteres, y contener una letra en minúscula, una letra en mayúscula y un número al menos.
pt: A palavra-passe deve ter pelo menos 8 caracteres, incluindo uma letra minúscula, uma letra maiúscula e um número.

# welcome_chunk
source: Hello
es: ¡Hola
pt: Olá

# birthdate_question
source: What's your birthdate?
es: ¿Cuándo naciste?
pt: Qual é a tua data de nascimento?

# height_question
source: What's your height?
es: ¿Cuánto mides?
pt: Qual é a tua altura?

# weight_question
source: What's your weight?
es: ¿Cuánto pesas?
pt: Qual é o teu peso?

# sex_question
source: What's your biological sex?
es: ¿Cuál es tu sexo biológico?
pt: Qual é o teu sexo biológico?

source: Save
es: Guardar
pt: Guardar

source: Food events
es: Eventos de comida
pt: Eventos alimentares

# food_event_hint
source: Write here your food
es: Escribe aquí tu comida
pt: Escreve aqui a tua refeição

# add_food_event
source: Add food
es: Añadir comida
pt: Adicionar refeição

# missing_event_date
source: You need to enter the date and time
es: Tienes que seleccionar la fecha y hora
pt: É necessário inserir a data e a hora

source: Edit food
es: Editar comida
pt: Editar refeição

# no_events_message
source: You have no events. You need to enter some
es: No tienes eventos. Tienes que introducir alguno
pt: Não tens eventos. É necessário inserir alguns

# add_sport_event
source: Add sport
es: Añadir deporte
pt: Adicionar desporto

source: Edit sport
es: Editar deporte
pt: Editar desporto

# sport_event_hint
source: Write here your sport
es: Escribe aquí tu deporte
pt: Escreve aqui a tua atividade desportiva

# missing_info_error
source: You need to enter the event information
pt: É necessário inserir as informações do evento

source: Sport events
es: Eventos de deporte
pt: Eventos desportivos

source: Duration
es: Duración
pt: Duração

source: Minutes
es: Minutos
pt: Minutos

source: Sleep events
es: Eventos de sueño
pt: Eventos de sono

source: Add sleep event
es: Añadir evento de sueño
pt: Adicionar evento de sono

# edit_sleep
source: Edit sleep event
es: Editar evento de sueño
pt: Editar evento de sono

# sleep_quality_question
source: How was the quality of your sleep? From 1 to 5.
es: ¿Cómo ha sido la calidad de tu sueño? De 1 a 5
pt: Como foi a qualidade do teu sono? De 1 a 5.

# sleep_duration_question
source: How long did you sleep?
es: ¿Cuántas horas has dormido?
pt: Quanto tempo dormiste?

source: Hours
es: Horas
pt: Horas

# not_selected_sleep_quality
source: You need to choose the sleep quality
pt: É necessário escolher a qualidade do sono

# poop_events
source: Stool events
es: Eventos de heces
pt: Eventos de fezes

# add_poop_event
source: Add stool event
es: Añadir evento de heces
pt: Adicionar evento de fezes

# edit_poop
source: Edit stool event
es: Editar evento de heces
pt: Editar evento de fezes

# poop_type_question
source: How was your stool today?
es: ¿Cómo han sido tus heces hoy? Selecciona una opción
pt: Como estão as tuas fezes hoje?

# not_selected_poop_type
source: You need to choose a stool type
es: Tienes que seleccionar el tipo de heces
pt: É necessário escolher um tipo de fezes

# abdominal_pain_question
source: I have experienced abdominal pain
es: He tenido dolor abdominal
pt: Senti dor abdominal

# gases_question
source: I have you experienced flatulence
es: He tenido gases
pt: Senti flatulência

# stool_type
source: Type
es: Tipo
pt: Tipo

source: Calendar
es: Calendario
pt: Calendário

# empty_events_calendar
source: There are no events registered today
es: No hay eventos registrados en este día
pt: Não há eventos registados hoje

source: Supplements
es: Suplementos
pt: Suplementos

# ml
source: mililiters
es: mililitros
pt: mililitros

# mg
source: miligrames
es: miligramos
pt: miligramas

# microg
source: microgrames
es: microgramos
pt: microgramas

# g
source: grames
es: gramos
pt: gramas

source: pill
es: comprimido
pt: comprimido

source: capsule
es: cápsula
pt: cápsula

source: spoon
es: cucharada
pt: colher

source: vial
es: ampolla
pt: ampola

source: drop
es: gota
pt: gota

source: drops
es: gotas
pt: gotas

source: Add new supplement
es: Añadir nuevo suplemento
pt: Adicionar novo suplemento

source: Edit supplement
es: Editar suplemento
pt: Editar suplemento

# add_new_supplement_event
source: Add supplement event
es: Añadir evento de suplemento
pt: Adicionar evento de suplemento

source: Edit supplement event
es: Editar evento de suplemento
pt: Editar evento de suplemento

source: Morning
es: Mañana
pt: Manhã

source: Lunch
es: Comida
pt: Almoço

source: Dinner
es: Cena
pt: Jantar

source: Night
es: Noche
pt: Noite

source: per take
es: por toma
pt: por toma

# enter_supplement_name
source: Enter the name of the supplement
es: Ingresa el nombre del suplemento
pt: Insere o nome do suplemento

# general_hint
source: Write it here
es: Escíbelo aquí
pt: Escreve aqui

source: Concentration
es: Concentración
pt: Concentração

source: Unit
es: Unidad
pt: Unidade

# quantity_per_box_question
source: How many units has the box?
es: ¿Cuántas unidades tiene la caja?
pt: Quantas unidades tem a embalagem?

# quantity_per_take_question
source: How many units do you take each time?
es: ¿Cuántas unidades tomas cada vez?
pt: Quantas unidades tomas de cada vez?

# pharmaceutical_form_question
source: What's the pharmaceutical form?
es: ¿Cuál es la forma farmacéutica?
pt: Qual é a forma farmacêutica?

# add_supplement_error
source: You need to fill all the fields
es: Debes completar todos los campos
pt: É necessário preencher todos os campos

# reactivate_or_add_supplement_question
source: What do you want to do?
es: ¿Qué quieres hacer?
pt: O que queres fazer?

source: Reactivate supplement
es: Reactivar suplemento
pt: Reativar suplemento

# reactivate_supplement_question
source: Which supplement do you want to reactivate?
es: ¿Qué suplemento quieres reactivar?
pt: Qual suplemento queres reativar?

# no_supplements_to_reactivate
source: There are no deactivated supplements
es: No hay suplementos desactivados
pt: Não existem suplementos desativados

source: Supplement list
es: Lista de suplementos
pt: Lista de suplementos

source: Exit
es: Salir
pt: Sair

# no_supplements_message
source: You have no supplements. You need to enter or activate any
es: No tienes suplementos. Tienes que introducir o activar alguno
pt: Não tens suplementos. É necessário inserir ou ativar algum

# taken_supplements_label
source: Supplements taken
es: Suplementos tomados
pt: Suplementos tomados

# not_selected_supplement_error
source: You have to choose the supplement
es: Tienes que seleccionar el suplemento
pt: É necessário escolher o suplemento

source: Reminders
es: Recordatorios
pt: Lembretes

# admin
source: Administrator
es: Admin
pt: Administrador

source: Questions
es: Preguntas
pt: Perguntas

# has_to_answer_all_questions_error
source: You need to answer all the questions
es: Tienes que contestar todas las preguntas.
pt: É necessário responder a todas as perguntas

# text_question_hint
source: Write your answer here
es: Escribe aquí tu respuesta
pt: Escreve a tua resposta aqui

# saving_event_error
source: There an error saving your event. Try again later.
es: Ha habido un error salvando tu evento, prueba más tarde
pt: Ocorreu um erro ao guardar o teu evento. Tenta novamente mais tarde.

source: Questionnaire
es: Cuestionario
pt: Questionário

source: Log out
es: Cierre de sesión
pt: Termina a sessão

# log_out_question
source: Do you really want to log out?
es: ¿Realmente quieres salir?
pt: Queres mesmo fazer logout?

source: Cancel
es: Cancelar
pt: Cancelar

source: Terms and conditions
es: Términos y condiciones
pt: Termos e condições

# terms_and_conditions_text
source: Effective Date: August 9, 2023 Please carefully read the following Terms and Conditions of Use ("Terms") before using our health mobile application (the "Application") developed by Maangata Apps. By using the Application, you agree to comply with these Terms and all applicable laws and regulations. If you do not agree with these Terms, please do not use the Application. Use of the Application The Application is designed to track user habits. It should not be considered a substitute for professional medical care. We do not provide medical diagnoses or specific treatment recommendations. You should always consult a qualified healthcare professional for personalized medical advice. Privacy We respect your privacy and are committed to protecting your personal data. Please review our Privacy Policy for detailed information on how we collect, use, and share your data in the Application. Intellectual Property All intellectual property rights related to the Application and its content (text, images, graphics, logos, etc.) are owned by Maangata Apps or its licensors. No license or implied right to use such intellectual property is granted without our prior written consent. Limitation of Liability To the maximum extent permitted by law, Maangata Apps shall not be liable for direct, indirect, incidental, special, or consequential damages arising from the use or inability to use the Application. Changes to the Terms We reserve the right to modify these Terms at any time. Any changes will be effective upon posting in the Application. We recommend regularly reviewing the Terms to stay informed of updates. Applicable Law These Terms shall be governed and interpreted in accordance with the laws of Spain. Any dispute arising in connection with these Terms shall be subject to the exclusive jurisdiction of the courts of Madrid. By using the Application, you agree to these Terms and commit to complying with them. If you do not agree with these Terms, you should not use the Application. If you have any questions about these Terms, you can contact us at maangata.apps@gmail.com. Maangata Apps. August 9, 2023.
es: Fecha de entrada en vigor: 9 de agosto de 2023. Por favor, lee detenidamente los siguientes Términos y Condiciones de Uso ("Términos") antes de utilizar nuestra aplicación móvil de salud (la "Aplicación") desarrollada por Maangata Apps. Al utilizar la Aplicación, aceptas cumplir con estos Términos y todas las leyes y regulaciones aplicables. Si no estás de acuerdo con estos Términos, por favor, no utilices la Aplicación. Uso de la Aplicación La Aplicación está diseñada para realizar un seguimiento de los hábitos del usuario. No debe considerarse como un sustituto de la atención médica profesional. No proporcionamos diagnósticos médicos ni recomendaciones específicas de tratamiento. Siempre debes consultar a un profesional de la salud calificado para obtener asesoramiento médico personalizado. Privacidad Respetamos tu privacidad y nos comprometemos a proteger tus datos personales. Consulta nuestra Política de Privacidad para obtener información detallada sobre cómo recopilamos, utilizamos y compartimos tus datos en la Aplicación. Propiedad Intelectual Todos los derechos de propiedad intelectual relacionados con la Aplicación y su contenido (textos, imágenes, gráficos, logotipos, etc.) son propiedad de Maangata Apps o sus licenciantes. No se otorga ninguna licencia o derecho implícito para utilizar dicha propiedad intelectual sin nuestro consentimiento previo por escrito. Limitación de Responsabilidad En la medida máxima permitida por la ley, Maangata Apps no será responsable por daños directos, indirectos, incidentales, especiales o consecuentes derivados del uso o la imposibilidad de usar la Aplicación. Cambios a los Términos Nos reservamos el derecho de modificar estos Términos en cualquier momento. Cualquier cambio será efectivo desde su publicación en la Aplicación. Te recomendamos revisar regularmente los Términos para estar al tanto de las actualizaciones. Ley Aplicable Estos Términos se regirán e interpretarán de acuerdo con las leyes de España. Cualquier disputa que surja en relación con estos Términos estará sujeta a la jurisdicción exclusiva de los tribunales de Madrid. Al utilizar la Aplicación, aceptas estos Términos y te comprometes a cumplir con ellos. Si no estás de acuerdo con estos Términos, no debes utilizar la Aplicación. Si tienes alguna pregunta sobre estos Términos, puedes ponerte en contacto con nosotros en maangata.apps@gmail.com. Maangata Apps. 9 de agosto de 2023.
pt: Data de Entrada em Vigor: 9 de agosto de 2023 Por favor, leia atentamente os seguintes Termos e Condições de Uso ("Termos") antes de utilizar a nossa aplicação móvel de saúde (a "Aplicação") desenvolvida pela Maangata Apps. Ao utilizar a Aplicação, concorda em cumprir estes Termos e todas as leis e regulamentos aplicáveis. Se não concordar com estes Termos, por favor, não utilize a Aplicação. Uso da Aplicação A Aplicação destina-se a rastrear os hábitos do utilizador. Não deve ser considerada um substituto para cuidados médicos profissionais. Não fornecemos diagnósticos médicos nem recomendações de tratamento específicas. Deve sempre consultar um profissional de saúde qualificado para obter aconselhamento médico personalizado. Privacidade Respeitamos a sua privacidade e comprometemo-nos a proteger os seus dados pessoais. Consulte a nossa Política de Privacidade para obter informações detalhadas sobre como recolhemos, utilizamos e partilhamos os seus dados na Aplicação. Propriedade Intelectual Todos os direitos de propriedade intelectual relacionados com a Aplicação e o seu conteúdo (texto, imagens, gráficos, logótipos, etc.) são propriedade da Maangata Apps ou dos seus licenciantes. Não é concedida nenhuma licença ou direito implícito para utilizar esta propriedade intelectual sem o nosso consentimento prévio por escrito. Limitação de Responsabilidade Na medida máxima permitida por lei, a Maangata Apps não será responsável por danos diretos, indiretos, incidentais, especiais ou consequenciais decorrentes do uso ou incapacidade de uso da Aplicação. Alterações aos Termos Reservamos o direito de modificar estes Termos a qualquer momento. Qualquer alteração entrará em vigor após a publicação na Aplicação. Recomendamos que reveja regularmente os Termos para estar informado das atualizações. Lei Aplicável Estes Termos serão regidos e interpretados de acordo com as leis de Espanha. Qualquer disputa decorrente destes Termos estará sujeita à jurisdição exclusiva dos tribunais de Madrid. Ao utilizar a Aplicação, concorda com estes Termos e compromete-se a cumpri-los. Se não concordar com estes Termos, não deve utilizar a Aplicação. Se tiver alguma questão sobre estes Termos, pode entrar em contacto connosco através de maangata.apps@gmail.com. Maangata Apps. 9 de agosto de 2023.

# accept_terms_and_conditions
source: I accept the terms and conditions
es: Acepto los términos y condiciones
pt: Eu aceito os termos e condições.

source: Accept
es: Aceptar
pt: Aceitar

# height_error
source: You have to choose your height
es: Tienes que elegir tu altura
pt: Tens de escolher a tua altura

# weight_error
source: You have to choose your weight
es: Tienes que elegir tu peso
pt: Tens de escolher o teu peso

# birth_date_error
source: You have to choose your birth date
es: Tienes que elegir tu fecha de nacimiento
pt: Tens de escolher a tua data de nascimento

# sex_error
source: You have to choose your sex
es: Tienes que elegir tu género
pt: Tens de escolher o teu género

# forgotten_password_info
source: Have you forgotten your password? Enter your email address and click the button below to reset it.
es: ¿Has olvidado tu contraseña? Introduce tu email y pulsa el botón de abajo para restituirla
pt: Esqueceu a sua senha? Insira o seu email e clique no botão abaixo para redefini-la.

# out_of_meals
source: Take out of meals
es: Tomar fuera de las comidas
pt: Tomar fora das refeições

# quantity_per_take_number_must_be_int_error
source: The amount per serving must be a whole number
es: La cantidad por toma debe ser un número entero

# quantity_per_box_number_must_be_int_error
source: The amount per box must be a whole number
es: La cantidad por envase debe ser un número entero
